Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Some applications require to send mails through different SMTP servers.
ja_jp: アプリケーションによっては、異なるSMTPサーバーを経由してメールを送信する必要があります。

source: Some basic metrics are published out of the box if `quarkus.scheduler.metrics.enabled` is set to `true` and a metrics extension is present.
ja_jp: `quarkus.scheduler.metrics.enabled` が `true` に設定されていて、metrics エクステンションが存在する場合、いくつかの基本的なメトリクスがすぐに公開されます。

source: Some browsers save credentials for basic authentication. If the dialog is not displayed, try to clear saved logins or use the Private mode
ja_jp: ブラウザによっては、Basic認証用のクレデンシャルを保存しています。ダイアログが表示されない場合は、保存されたログイン情報を消去するか、プライベートモードを使用してください。

source: Some bugfixes are a bit more involved than what we usually include in maintenance releases, so if you encounter any issue upgrading, please report them with as many details as you can (and preferably with a reproducer) in https://github.com/quarkusio/quarkus/issues[our tracker].
ja_jp: いくつかのバグフィックスは、通常のメンテナンスリリースに含まれているものよりも、もう少し複雑なものになっていますので、もしアップグレードで問題に遭遇した場合は、できるだけ詳細に（できれば再現手順も含めて） link:https://github.com/quarkusio/quarkus/issues[課題管理]に報告してください。

source: Some common properties to migrate are:
ja_jp: 移行する一般的なプロパティーは次のとおりです。

source: Some components may require additional initialization based on information collected during augmentation. The most straightforward solution is to obtain a bean instance and call a method directly from a build step. However, it is _illegal_ to obtain a bean instance during the augmentation phase. The reason is that the CDI container is not started yet. It's started during the <<bootstrap-three-phases,Static init bootstrap phase>>.
ja_jp: コンポーネントによっては、拡張中に収集された情報に基づいて、追加の初期化が必要になる場合があります。 最も簡単な解決策は、Bean インスタンスを取得し、ビルドステップから直接メソッドを呼び出すことです。 しかし、拡張フェーズで Bean インスタンスを取得することは _違反_ です。 理由は、CDI コンテナーがまだ起動していないからです。 CDI コンテナーは <<bootstrap-three-phases,静的初期化ブートストラップフェーズ>> で起動されています。

source: Some connectors support configuring the concurrency level of incoming channels.
ja_jp: 一部のコネクターは、着信チャネルの同時実行レベルの設定をサポートしています。

source: Some consumer client properties are configured to sensible default values:
ja_jp: 一部のコンシューマクライアントプロパティーは、適切なデフォルト値に設定されています。

source: Some contents have not been translated yet, but we are continuing to translate them one by one. We are working on the localization of the contents on a GitHub public repository (https://github.com/quarkusio/ja.quarkus.io[https://github.com/quarkusio/ja.quarkus.io]), and we are welcoming pull-requests to translate them. If you are interested in localizing quarkus.io, come and join us! For more details about how to contribute the localization project, please see https://github.com/quarkusio/ja.quarkus.io/blob/master/translation-guide.ja.md[translation guide(ja)].
ja_jp: 一部のコンテンツはまだ翻訳されていませんが、1つずつ翻訳を続けています。GitHubのパブリックレポジトリ (https://github.com/quarkusio/ja.quarkus.io[https://github.com/quarkusio/ja.quarkus.io]) でコンテンツのローカリゼーションに取り組んでおり、翻訳のPull-Requestは大歓迎です。quarkus.ioのローカライズに興味がある場合は、ぜひご参加ください。ローカリゼーションプロジェクトへの貢献方法の詳細については、 https://github.com/quarkusio/ja.quarkus.io/blob/master/translation-guide.ja.md[翻訳ガイド(ja)] を参照してください。

source: Some context
ja_jp: いくつかのコンテキスト

source: Some databases like H2 and Derby are commonly used in "embedded mode" as a facility to run quick integration tests.
ja_jp: H2 や Derby のようなデータベースの中には、迅速な統合テストを実行するためのファシリティして "embedded mode" で一般的に使用されているものもあります。

source: Some databases like H2 and Derby are commonly used in the _embedded mode_ as a facility to run integration tests quickly.
ja_jp: H2やDerbyのようないくつかのデータベースは、結合テストを迅速に実行するための機能として、 _組み込み_ モードで一般的に使用されています。

source: Some databases like MariaDB/MySQL do not support database schemas by default. In these cases you can either: 1. Configure the JDBC driver to support schemas. Use `quarkus.datasource.jdbc.additional-jdbc-properties."databaseTerm"=SCHEMA` or `quarkus.datasource."datasource-name".jdbc.additional-jdbc-properties."databaseTerm"=SCHEMA` for https://dev.mysql.com/doc/connector-j/en/connector-j-connp-props-connection.html#cj-conn-prop_databaseTerm[MySQL Connector/J]. Use `quarkus.datasource.jdbc.additional-jdbc-properties."useCatalogTerm"=SCHEMA` or `quarkus.datasource."datasource-name".jdbc.additional-jdbc-properties."useCatalogTerm"=SCHEMA` for https://mariadb.com/docs/connectors/mariadb-connector-j/about-mariadb-connector-j[MariaDB Connector/J].
ja_jp: MariaDBやMySQLなどの一部のデータベースは、デフォルトではデータベーススキーマをサポートしていません。これらの場合、以下のいずれかを行います。 1. スキーマをサポートするように JDBC ドライバーを構成する。 link:https://dev.mysql.com/doc/connector-j/en/connector-j-connp-props-connection.html#cj-conn-prop_databaseTerm[MySQL Connector/J] の場合は、 `quarkus.datasource.jdbc.additional-jdbc-properties."databaseTerm"=SCHEMA` または `quarkus.datasource."datasource-name".jdbc.additional-jdbc-properties."databaseTerm"=SCHEMA` を使用します。 link:https://mariadb.com/docs/connectors/mariadb-connector-j/about-mariadb-connector-j[MariaDB Connector/J] の場合は、 `quarkus.datasource.jdbc.additional-jdbc-properties."useCatalogTerm"=SCHEMA` または `quarkus.datasource."datasource-name".jdbc.additional-jdbc-properties."useCatalogTerm"=SCHEMA` を使用します。

source: Some databases like MariaDB/MySQL do not support database schemas. In these cases you have to use the <<database-approach,database approach>>.
ja_jp: MariaDB/MySQL などの一部のデータベースはデータベーススキーマをサポートしていません。このような場合は、<<database-approach,database approach>> を使用する必要があります。

source: Some decorators are included by default by Quarkus extensions.
ja_jp: 一部のデコレーターは、Quarkus エクステンションによってデフォルトで含まれています。

source: Some dynamically generated data (e.g. `dependencies` and `test-dependencies`)
ja_jp: いくつかの動的に生成されたデータ（例： `dependencies` や `test-dependencies` ）

source: Some environment cuts the SSE connection when there is not enough activity. The workaround consists of sending _ping_ messages (or empty objects) periodically.
ja_jp: 一部の環境では、十分なアクティビティーがない場合に SSE 接続が切断されます。回避策として、定期的に _ping_ メッセージ (または空のオブジェクト) を送信することが挙げられます。

source: Some environments, e.g., Kubernetes, provide ways to discover service locations and load-balance the traffic. Some do not. In some cases, the capabilities of the environment are not sufficient for the needs of the system.
ja_jp: Kubernetesなどの一部の環境では、サービスの場所を発見し、トラフィックをロードバランスする方法を提供しています。そうでないものもあります。場合によっては、環境の機能がシステムのニーズに対して十分でないこともあります。

source: Some examples are provided in the sections below:
ja_jp: いくつかの例は、以下のセクションで提供されています。

source: Some examples are: `@PreAuthorize("hasAnyRole('admin')")`, `@PreAuthorize("hasAnyRole(@roles.USER, 'view')")`
ja_jp: 一部の例として、 `@PreAuthorize("hasAnyRole('admin')")`、 `@PreAuthorize("hasAnyRole(@roles.USER, 'view')")` があります。

source: Some examples are: `@PreAuthorize("hasRole('admin')")`, `@PreAuthorize("hasRole(@roles.USER)")` where the `roles` is a bean that could be defined like so:
ja_jp: 一部の例として、 `@PreAuthorize("hasRole('admin')")`、 `@PreAuthorize("hasRole(@roles.USER)")` があります。この `roles` は、以下のように定義できる Bean になります。

source: Some examples of allowed expressions are:
ja_jp: 許可される式の例は次のとおりです。

source: Some extension may provide default health checks, including the extension will automatically register its health checks.
ja_jp: 一部のエクステンションでは、デフォルトのヘルスチェックを提供している場合があり、その場合、エクステンションは自動的にヘルスチェックを登録します。

source: Some extensions are contributed and maintained by the community:
ja_jp: いくつかのエクステンションはコミュニティーによって提供され、維持されています。

source: Some extensions have overlapping functionality and there are recommended extensions for each type of signal.
ja_jp: 一部のエクステンションには重複する機能があり、シグナルの種類ごとに推奨されるエクステンションがあります。

source: Some extensions may be private, and some may wish to be part of the broader Quarkus ecosystem, and available for community re-use. Inclusion in the Quarkiverse Hub is a convenient mechanism for handling continuous testing and publication. The link:https://github.com/quarkiverse/quarkiverse/wiki#getting-an-extension-onboarded[Quarkiverse Hub wiki] has instructions for on-boarding your extension.
ja_jp: エクステンションの中には、非公開のものもあれば、より広範なQuarkusエコシステムの一部として、コミュニティの再利用を可能にしたいものもあります。Quarkiverse Hubに参加することは、継続的テストと公開を行うための便利なメカニズムです。 link:https://github.com/quarkiverse/quarkiverse/wiki#getting-an-extension-onboarded[Quarkiverse Hubのwiki] には、エクステンションの追加に関する説明があります。

source: Some extensions may be private, and some may wish to be part of the broader Quarkus ecosystem, and link:https://quarkus.io/extensions/[available for community re-use]. Inclusion in the Quarkiverse Hub is a convenient mechanism for handling continuous testing and publication. The link:https://hub.quarkiverse.io/home/#getting-an-extension-onboarded[Quarkiverse Hub wiki] has instructions for on-boarding your extension.
ja_jp: エクステンションの中には、非公開のものもあれば、より広範な Quarkus エコシステムの一部として、 link:https://quarkus.io/extensions/[コミュニティーでの再利用を可能] にしたいものもあります。 Quarkiverse Hubに参加することは、継続的テストと公開を行う ための便利なメカニズムです。 link:https://hub.quarkiverse.io/home/#getting-an-extension-onboarded[Quarkiverse Hub wiki] には、エクステンションの オンボードに関する説明があります。

source: Some extensions may provide pre-configured Java options that should be added to the command line launching an application in Dev mode.
ja_jp: 一部のエクステンションでは、開発モードでアプリケーションを起動するコマンドラインに追加する必要がある、事前設定された Java オプションが提供される場合があります。

source: Some extensions moved to Quarkiverse Hub
ja_jp: 一部のエクステンションはQuarkiverse Hubに移動しました。

source: Some extensions provide extremely sophisticated Dev UIs. For example, they might allow users to interact with the running application (in dev mode), xref:dev-ui.adoc#hot-reload[respond to reloads], visualise application metrics, or xref:dev-ui.adoc#footer[stream an application-specific log]. The xref:dev-ui.adoc[Dev UI] guide also explains these more advanced options.
ja_jp: 一部のエクステンションは、非常に洗練された Dev UI を提供します。例えば、ユーザーが (開発モードで) 実行中のアプリケーションと対話したり、xref:dev-ui.adoc#hot-reload[リロードに応答したり]、アプリケーションメトリクスを視覚化したり、または xref:dev-ui.adoc#footer[アプリケーション固有のログをストリームしたりする]ことを可能にします。 xref:dev-ui.adoc[Dev UI] ガイドでは、これらのより高度なオプションについても説明されています。

source: Some extensions provide extremely sophisticated Dev UIs. For example, they might allow users to interact with the running application, xref:dev-ui.adoc#hot-reload[respond to reloads], visualise application metrics, or xref:dev-ui.adoc#add-a-log-to-the-footer[stream an application-specific log]. The xref:dev-ui.adoc[Dev UI for extension developers] guide also explains these more advanced options.
ja_jp: 一部のエクステンションは非常に洗練された Dev UI を提供します。 たとえば、実行中のアプリケーションと対話したり、リロードに応答したり、アプリケーションメトリクスを視覚化したり、アプリケーション固有のログをストリームしたりできるようになります。 xref:dev-ui.adoc[エクステンション開発者向けの開発 UI] ガイドでも、これらのより高度なオプションについて説明しています。

source: Some extensions such as `OIDC`, `OAuth2`, `SmallRye JWT`, `LDAP` have the inlined `IdentityProvider` implementations which are specific to the supported authentication flow. For example, `quarkus-oidc` uses its own `IdentityProvider` to convert a token to `SecurityIdentity`.
ja_jp: `OIDC` , `OAuth2` , `SmallRye JWT` , `LDAP` などのエクステンションには、サポートされている認証フローに固有の `IdentityProvider` のインライン実装があります。例えば、 `quarkus-oidc` は独自の `IdentityProvider` を使用してトークンを `SecurityIdentity` に変換します。

source: Some extensions, for example, `OIDC`, `OAuth2`, and `SmallRye JWT` have inline `IdentityProvider` implementations specific to the supported authentication flow. For example, `quarkus-oidc` uses its own `IdentityProvider` to convert a token to a `SecurityIdentity` instance.
ja_jp: 一部のエクステンション、たとえば、 `OIDC` 、 `OAuth2` 、 `SmallRye JWT` は、サポートされる認証フローに固有のインライン `IdentityProvider` 実装を持ちます。たとえば、 `quarkus-oidc` は、トークンを `SecurityIdentity` インスタンスに変換するために、独自の `IdentityProvider` を使用します。

source: Some extensions, for example, `OIDC`, `OAuth2`, and `SmallRye JWT`, have inline `IdentityProvider` implementations specific to the supported authentication flow. For example, `quarkus-oidc` uses its own `IdentityProvider` to convert a token to a `SecurityIdentity` instance.
ja_jp: 一部のエクステンション(たとえば、 `OIDC` 、 `OAuth2` 、 `SmallRye JWT` など)は、サポートされる認証フローに固有のインライン `IdentityProvider` 実装を持っています。たとえば、 `quarkus-oidc` は、トークンを `SecurityIdentity` インスタンスに変換するために、独自の `IdentityProvider` を使用します。

source: Some extensions, such as the ones for OIDC and SmallRye JWT, include inline `IdentityProvider` implementations specific to the supported authentication flow. For example, `quarkus-oidc` uses its own `IdentityProvider` to convert a token to a `SecurityIdentity` instance.
ja_jp: OIDCやSmallRye JWTのような一部のエクステンションには、サポートされる認証フローに特化したインライン `IdentityProvider` 実装が含まれています。 たとえば `quarkus-oidc` は、独自の `IdentityProvider` を使用してトークンを `SecurityIdentity` インスタンスに変換します。

source: Some familiarity with the Spring DI extension
ja_jp: Spring DI エクステンションにある程度慣れている

source: Some familiarity with the Spring Web extension
ja_jp: Spring Webエクステンションに精通していること

source: Some features are always included in a native executable even though they might never be actually used at run time. An example of such a feature is garbage collection. At compile time we can’t be sure whether an application will need to run garbage collection at run time, so garbage collection is always included in native executables increasing their size even if not necessary. Native executable generation relies on static code analysis to identify which code paths are reachable, and static code analysis can be imprecise leading to more code getting into the image than what’s actually needed.
ja_jp: ネイティブ実行可能ファイルには、実行時に実際には使われないかもしれないのに、必ず含まれている機能があります。そのような機能の例として、ガベージコレクションがあります。コンパイル時には、アプリケーションが実行時にガベージコレクションを実行する必要があるかどうかはわかりません。そのため、ガベージコレクションは、必要がないにもかかわらず、常にネイティブ実行可能ファイルに含まれ、サイズが大きくなります。ネイティブ実行可能ファイルの生成は、どのコードパスが到達可能かを特定するために、静的なコード解析に依存していますが、静的なコード解析は不正確な場合があり、実際に必要なコードよりも多くのコードがイメージに入ってしまうことがあります。

source: Some frameworks use aggressive lazy initialization techniques. It is important to measure the startup time to first request to most accurately reflect how long a framework needs to start. Otherwise, you will miss the time the framework _actually_ takes to initialize.
ja_jp: フレームワークの中には、アグレッシブな遅延初期化技術を使用しているものがあります。フレームワークを開始するために必要な時間を最も正確に反映させるために、最初のリクエストまでの起動時間を測定することが重要です。そうしないと、フレームワークが _実際に_ 初期化にかかる時間を見逃してしまいます。

source: Some frequently asked guides are the following:
ja_jp: よくある質問として、以下のようなガイドがあります。

source: Some guidelines:
ja_jp: ガイドラインが複数あります。

source: Some https://github.com/quarkusio/quarkus/tree/main/extensions/devui/resources/src/main/resources/dev-ui/controller[internal controllers] are available to make certain things easier:
ja_jp: 特定のことを容易にするために、いくつかの https://github.com/quarkusio/quarkus/tree/main/extensions/devui/resources/src/main/resources/dev-ui/controller[内部コントローラー] が利用可能です:

source: Some https://github.com/quarkusio/quarkus/tree/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/controller[internal controllers] are available to make certain things easier:
ja_jp: 特定のことを簡単にするために、いくつかの link:https://github.com/quarkusio/quarkus/tree/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/controller[内部コントローラー] が用意されている：

source: Some https://github.com/quarkusio/quarkus/tree/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/qui[internal UI components] (under the `qui` namespace) are available to make certain things easier:
ja_jp: いくつかの link:https://github.com/quarkusio/quarkus/tree/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/qui[内部UIコンポーネント] （ `qui` ネームスペース）は、特定のことを簡単にするために利用可能です：

source: Some important links for reference:
ja_jp: 参考までに重要なリンクをいくつか挙げておきます。

source: Some improvements have also been made to the Quarkus Hibernate ORM extension itself, such as:
ja_jp: また、Quarkus Hibernate ORMエクステンション自体にも、次のような改良が加えられています:

source: Some known limitations:
ja_jp: いくつかの既知の制約があります:

source: Some libraries are using `ThreadLocal` as an object pooling mechanism. Extremely popular libraries like https://github.com/FasterXML/jackson-core/issues/919[Jackson] and Netty assume that the application uses a limited number of threads, which are recycled (using a thread pool) to run multiple (unrelated but sequential) tasks.
ja_jp: 一部のライブラリーは、オブジェクトプーリングメカニズムとして `ThreadLocal` を使用しています。 https://github.com/FasterXML/jackson-core/issues/919[Jackson] および Netty などの非常に人気の高いライブラリーは、アプリケーションが限られた数のスレッドを使用し、それらのスレッドが (スレッドプールを使用して) リサイクルされて、複数の (無関係だが連続した) タスクを実行することを前提としています。

source: Some logging related classes, as logging must be loaded by the system ClassLoader
ja_jp: ロギングはシステム ClassLoader によってロードされなければならないので、いくつかのロギング関連のクラス

source: Some messaging extensions integrate with the xref:./tls-registry-reference.adoc[Quarkus TLS Registry] to configure the underlying client. To configure the TLS on a channel, you need to provide the named TLS configuration to the `tls-configuration-name` property:
ja_jp: 一部のメッセージングエクステンションは、xref:./tls-registry-reference.adoc[Quarkus TLS レジストリー] と統合して、基盤となるクライアントを設定します。 チャネルで TLS を設定するには、`tls-configuration-name` プロパティーに名前付き TLS 設定を指定する必要があります。

source: Some messaging technologies allow consumers to subscribe to a set of topics or queues, and producers to send messages to a specific topic on message basis. If you are sure you need to configure and create clients dynamically at runtime, you should consider using the low-level clients directly.
ja_jp: 一部のメッセージングテクノロジーでは、コンシューマーがトピックまたはキューのセットをサブスクライブし、プロデューサーがメッセージベースで特定のトピックにメッセージを送信できます。 実行時にクライアントを動的に設定および作成する必要があることが確実な場合は、低レベルのクライアントを直接使用することを検討する必要があります。

source: Some metrics might be missing from the output if they contain no data.
ja_jp: 一部のメトリクスは、データが含まれていない場合、出力に含まれない可能性があります。

source: Some numbers
ja_jp: いくつかの数値

source: Some of our extensions requires some additions to properly support Kotlin. This is the case of the MongoDB with Panache extension.
ja_jp: 私たちのエクステンションの中には、Kotlin を適切にサポートするためにいくつかの追加を必要とするものがあります。これは MongoDB with Panache エクステンションがそうです。

source: Some of these extensions are maintained in the core Quarkus repository:
ja_jp: これらのエクステンションの一部は、コア Quarkus リポジトリーで管理されています。

source: Some of you have asked how to turn this non-application endpoint root stuff off entirely. A clear expression of your intent is best. To disable the non-application endpoint, make it identical to the HTTP root path. In essence, you are telling the runtime to "serve all non-application endpoints from the HTTP root". This example uses a variable to ensure the values remain the same:
ja_jp: 何人かの方から、このアプリケーション以外のエンドポイントルートのものを完全にオフにするにはどうすればよいかという質問を受けました。あなたの意図を明確に表現するのがベストです。非アプリケーションエンドポイントを無効にするには、HTTPルートパスと同じにしてください。要するに、ランタイムに「HTTPルートからすべての非アプリケーションエンドポイントを提供する」ように指示していることになります。この例では、値が同じであることを保証するために変数を使用しています。

source: Some options need to be set:
ja_jp: いくつかのオプションを設定する必要があります:

source: Some other JDBC extensions can be found in the Quarkiverse such as:
ja_jp: その他のJDBCエクステンションは、Quarkiverseにいくつか掲載されています。

source: Some other _fun_ facts
ja_jp: その他の _面白い_ 事実

source: Some other features affect specification compatibility as well:
ja_jp: その他にも、仕様の互換性に影響を与える機能があります:

source: Some panels in the dashboards might take a few minutes to show accurate data when their values are calculated over a sliding time window.
ja_jp: ダッシュボードの一部のパネルでは、値がスライディングタイムウィンドウにわたって計算される場合、正確なデータが表示されるまでに数分かかることがあります。

source: Some previous releases of GraalVM included the `native-image` tool by default. This is no longer the case; it must be installed as a second step after GraalVM itself is installed. Note: there is an outstanding issue xref:graal-and-catalina[using GraalVM with macOS Catalina].
ja_jp: GraalVMの以前のリリースでは、デフォルトで `native-image` ツールが含まれていました。現在はそのようになっておらず、GraalVM自体をインストールした後の第二ステップとしてインストールする必要があります。注意: #graal-and-catalina[macOS CatalinaでGraalVMを使用する]際に、未解決の問題が発生しています。

source: Some producer client properties are configured to sensible default values:
ja_jp: 一部のプロデューサークライアントプロパティーは、適切なデフォルト値に設定されています。

source: Some projections indicated that at project end, the different clusters in production would contain 10'000 pods.
ja_jp: プロジェクト終了時には、さまざまなクラスターで10,000個のポッドが含まれているという予測もありました。

source: Some properties have aliases which can be configured globally:
ja_jp: 一部のプロパティには、グローバルに設定可能なエイリアスがあります。

source: Some providers such as `Auth0` do not support a standard RP initiated logout so the provider specific logout properties will have to be configured for a logout option be visible, please see xref:security-openid-connect-web-authentication.adoc#user-initiated-logout[OpenID Connect User-Initiated Logout] for more information.
ja_jp: `Auth0` などの一部のプロバイダーは標準の RP 主導型ログアウトをサポートしていないため、プロバイダー固有のログアウトプロパティーを設定しなければ、ログアウトオプションは表示されません。詳細は、 xref:security-openid-connect-web-authentication.adoc#user-initiated-logout[OpenID Connect ユーザー主導型ログアウト] を参照してください。

source: Some providers such as `Auth0` do not support a standard RP initiated logout so the provider specific logout properties will have to be confogured for a logout option be visible, please see xref:security-openid-connect-web-authentication.adoc#user-initiated-logout[OpenID Connect User-Initiated Logout] for more information.
ja_jp: `Auth0` などの一部のプロバイダーは標準の RP 主導型ログアウトをサポートしていないため、プロバイダー固有のログアウトプロパティーを設定しなければ、ログアウトオプションは表示されません。詳細は、curity-openid-connect-web-authentication.adoc#user-initiated-logout[OpenID Connect ユーザー主導型ログアウト] を参照してください。

source: Some providers will only accept HTTPS-based redirect URIs. Tools such as https://ngrok.com/[ngrok] https://linuxhint.com/set-up-use-ngrok/[can be set up] to help testing such providers with Quarkus endpoints running on localhost in dev mode.
ja_jp: プロバイダーによっては、 https ベースのリダイレクト URI のみを受け入れます。 https://ngrok.com/[ngrok] https://linuxhint.com/set-up-use-ngrok/[設定可能] などのツールは、開発モードで localhost 上で実行されている Quarkus エンドポイントを使用してこのようなプロバイダーをテストするのに役立ちます。

source: Some providers, such as `Auth0` do not support a standard RP-initiated logout, so the provider-specific logout properties must be configured for a logout option to be visible. For more information, see xref:security-oidc-code-flow-authentication.adoc#user-initiated-logout[User-initiated logout] section in the "OpenID Connect authorization code flow mechanism for protecting web applications" guide.
ja_jp: `Auth0` などの一部のプロバイダーは、標準の RP 起点のログアウトをサポートしていないため、ログアウトオプションを表示するには、プロバイダー固有のログアウトプロパティーを設定する必要があります。 詳細は、「Web アプリケーションを保護するための OpenID Connect 認可コードフローメカニズム」ガイドの xref:security-oidc-code-flow-authentication.adoc#user-initiated-logout[ユーザー起点のログアウト] セクションを参照してください。

source: Some providers, such as the xref:security-openid-connect-providers#strava[Strava OAuth2 provider], require client credentials be posted as HTTP POST query parameters:
ja_jp: 一部のプロバイダ ( xref:security-openid-connect-providers.adoc#strava[Strava OAuth2 プロバイダなど] ) では、クライアントのクレデンシャルを HTTP POST クエリパラメータとして投稿する必要があります：

source: Some providers, such as the xref:security-openid-connect-providers.adoc#strava[Strava OAuth2 provider], require client credentials be posted as HTTP POST query parameters:
ja_jp: xref:security-openid-connect-providers.adoc#strava[Strava OAuth2 プロバイダー] などの一部のプロバイダーでは、クライアントクレデンシャルを HTTP POST クエリーパラメーターとして送信する必要があります。

source: Some providers, such as the xref:security-openid-connect-providers.adoc#strava[Strava OAuth2 provider], require client credentials to be posted as HTTP POST query parameters:
ja_jp: xref:security-openid-connect-providers.adoc#strava[Strava OAuth2 プロバイダー] など、一部のプロバイダーでは、クライアントクレデンシャルを HTTP POST クエリーパラメーターとして送信する必要があります。

source: Some supported authentication mechanisms are built into Quarkus, while others require you to add an extension. All of these mechanisms are detailed in the following sections:
ja_jp: サポートされている認証メカニズムは、Quarkus に組み込まれているものもあれば、エクステンションを追加する必要があるものもあります。 これらのメカニズムについては、次のセクションで詳しく説明します:

source: Some supported authentication mechanisms are built into Quarkus, while others require you to add an extension. The following table maps specific authentication requirements to a supported mechanism that you can use in Quarkus:
ja_jp: サポートされている認証メカニズムの一部は Quarkus に組み込まれていますが、それ以外ではエクステンションを追加する必要があります。 次の表では、Quarkus で使用できるサポート対象メカニズムとその認証要件をマッピングしています。

source: Some things to notice about these instructions:
ja_jp: 以下は、これらの手順に関する注意事項です。
